app/views/lotteries/confirmation.html.erb

                        <%=icon("car")%> Vagas <%= lottery.vacancies %><br>
                        <%=icon("users")%> Inscritos <%= lottery.players.count%>
---
SELECT COUNT(*) FROM "players" WHERE "players"."lottery_id" = ?  [["lottery_id", 1]]