app/views/lotteries/index.html.erb

SELECT COUNT(*) FROM "players" WHERE "players"."lottery_id" = ?  [["lottery_id", 1]]
---
        <td><%= lottery.vacancies %></td>
        <td><%= lottery.players.count %></td>