app/views/lotteries/show.html.erb

  <tbody>
    <% @lottery.players.each do |player| %>
---
SELECT "players".* FROM "players" WHERE "players"."lottery_id" = ?  [["lottery_id", 1]]