app/views/players/_form.html.erb

       <div class="col-md-5">
           <%= f.collection_select(:lottery_id,Lottery.where(closed: false),:id,:name_in_collection, {prompt: "Selecione o Sorteio",label: "Sorteio" })%>
---
SELECT "lotteries".* FROM "lotteries" WHERE "lotteries"."closed" = ?  [["closed", "f"]]