app/controllers/lotteries_controller.rb

 def confirmation
   @lotteries = Lottery.all
---
SELECT "lotteries".* FROM "lotteries"

  def index
    @lotteries = Lottery.all
---
SELECT "lotteries".* FROM "lotteries"

  def create
    @lottery = Lottery.new(lottery_params)

    respond_to do |format|
      if @lottery.save
---
INSERT INTO "lotteries" ("initial_date", "final_date", "vacancies", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["initial_date", "2016-10-04"], ["final_date", "2016-10-11"], ["vacancies", 5], ["created_at", "2016-10-05 19:21:44.362364"], ["updated_at", "2016-10-05 19:21:44.362364"]]

    def set_lottery
      @lottery = Lottery.find(params[:id])
---
SELECT  "lotteries".* FROM "lotteries" WHERE "lotteries"."id" = ? LIMIT 1  [["id", 1]]