app/controllers/players_controller.rb

  def create
    @player = Player.new(player_params)

    respond_to do |format|
      #
      if @player.save
---
INSERT INTO "players" ("email", "lottery_id", "lucky_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "teste123"], ["lottery_id", 1], ["lucky_number", 642], ["created_at", "2016-10-05 19:22:03.582741"], ["updated_at", "2016-10-05 19:22:03.582741"]]