app/controllers/winners_controller.rb

SELECT "players".* FROM "players" WHERE "players"."winner" = ?  [["winner", "t"]]
---
    def index
        @players = Player.where(winner: true)